app/controllers/admin/content_controller.rb

  def edit
    @article = Article.find(params[:id])
    @current_user_is_admin = Profile.find(current_user.profile_id).label == "admin"
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = 1 LIMIT 1

  def insert_editor
    editor = 'visual'
    editor = 'simple' if params[:editor].to_s == 'simple'
    current_user.editor = editor
    current_user.save!
---
UPDATE "users" SET "settings" = '---

  def merge_with
    @article = Article.find(params[:id])
    unless Profile.find(current_user.profile_id).label == "admin"
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = 1 LIMIT 1