app/controllers/admin/content_controller.rb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = 1 LIMIT 1
---
  def merge_article
    @article = Article.find(params[:id])
    unless Profile.find(current_user.profile_id).label == "admin"